tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Immersed_New/ImmersedCyl-Static-Re20-Mesh1250/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  8
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}

// --------------------------- Global settings --------------------------------

bodyNames ("cylinder");

interpolationSchemes
{
    U cellPointFace;
}

surfaceThreshold        1e-4;
stepDEM                 0.1;

// Use your setting; in pure 2D extrusion you might use (1 1 -1), but keep as-is
// if your solver/case expects 3D with thin z.
geometricD              (1 1 1);

recordSimulation        true;
recordFirstTimeStep     false;

nSolidsInDomain         1000;
ibCouplingCoeff         0.2;

outputSetup
{
    basic        true;
    iB           false;
    DEM          false;
    addModel     true;
    parallelDEM  false;
}

virtualMesh
{
    level        2;
    charCellSize 0.01;
}

// ------------------------------- DEM ----------------------------------------

DEM
{
    LcCoeff       4.0;
    rotationModel chen2012;

    materials
    {
        particle
        {
            Y     1e7;
            nu    0.3;
            mu    0.05;
            adhN  0;
            eps   0.5;
        }

        wall
        {
            Y     1e7;
            nu    0.2;
            mu    0;
            adhN  0;
            eps   0.5;
        }
    }

    collisionPatches {}
}

// ============================ Cylinder body =================================

cylinder
{
    // HARD force static body (recommended for benchmark)
    bodyOperation 0;

    rho   rho [1 -3 0 0 0 0 0] 5000;

    U { BC noSlip; }

    material        particle;

    bodyGeom        stlBased;
    stlBasedCoeffs
    {
        fileName "constant/triSurface/cylinder.stl";
        // fileName "constant/triSurface/safe/cylinder_safe.stl";
    }

    sdBasedLambda    false;
    interfaceSpan    2.0;
    startSynced      false;
    refineBuffers    2;

    // keep this as in your original
    timesToSetStatic -1;

    // IMPORTANT: motion block removed for static benchmark
    //deformingBody_sinusoidalTranslation
    //{
    //    amplitude   0.5;
    //    period      1.0;
    //    phase       0.0;
    //    direction   (1 0 0);
    //}

    // KEEP bodyAddition block present (even as no-op) – your code path expects it
    bodyAddition
    {
        addModel           once;
        distributionCoeffs
        {
            addMode         boundBox;
            stlBaseSize     1e-5;
            addDomain       boundBox;
            boundBoxCoeffs
            {
                minBound (0 0 0);
                maxBound (0 0 0);
            }
        }
    }
}
